# MSADS 507 M4

## Importing Libraries

In [1]:
import numpy as no
import pandas as pd
import pymysql as mysql
import matplotlib.pyplot as plt 
import warnings 
warnings.filterwarnings('ignore')


userName = 'root'
userPass = 'yb%Q8!ec'

## Creating SQL DB Connection

In [2]:
conn=mysql.connect(host='localhost',port=int(3306),user=userName,passwd=userPass,db='gravity_books')

In [3]:
tableNames = pd.read_sql("""SHOW TABLES""", conn) 
tableNames

   Tables_in_gravity_books
0                  address
1           address_status
2                   author
3                     book
4              book_author
5            book_language
6                  country
7               cust_order
8                 customer
9         customer_address
10           order_history
11              order_line
12            order_status
13              population
14               publisher
15         shipping_method

## Exploratory Data Analysis

In [4]:
# 1. Period: the transaction between ** to **

#latest order date:
a = pd.read_sql_query("""

SELECT order_date 
FROM cust_order
ORDER BY order_date DESC 
LIMIT 1

""" , con = conn) 
a

           order_date
0 2023-02-13 06:37:24

In [5]:
# earliest order date:

b = pd.read_sql_query("""

SELECT order_date 
FROM cust_order 
ORDER BY order_date
LIMIT 1

""" , con = conn) 
b

           order_date
0 2020-02-14 17:22:16

In [6]:
# order counts in the first year:

c = pd.read_sql_query("""

SELECT COUNT(*)
FROM cust_order
WHERE order_date BETWEEN '2020-02-06' AND '2021-02-05'

""" , con = conn) 
c

   COUNT(*)
0      2450

In [7]:
# order counts in the second year:

d = pd.read_sql_query("""

SELECT COUNT(*)
FROM cust_order
WHERE order_date BETWEEN '2021-02-06' AND '2022-02-05'

""" , con = conn) 
d

   COUNT(*)
0      2608

In [8]:
# order counts in the last year:

d = pd.read_sql_query("""

SELECT COUNT(*)
FROM cust_order
WHERE order_date BETWEEN '2022-02-06' AND '2023-02-05'

""" , con = conn) 
d

   COUNT(*)
0      2429

In [9]:
# 2. How many orders and books are sold in total?

e = pd.read_sql_query("""

SELECT COUNT(order_id), COUNT(book_id) books_sold
FROM order_line;

""" , con = conn) 
e

   COUNT(order_id)  books_sold
0            15400       15400

In [10]:
# 3. How many customer numbers are in the data?

f = pd.read_sql_query("""

SELECT COUNT(DISTINCT(customer_id)) 
FROM cust_order;

""" , con = conn) 
f

   COUNT(DISTINCT(customer_id))
0                          1712

In [11]:
# 4. Which customer placed the most orders?

g = pd.read_sql_query("""

SELECT c.customer_id, c.first_name, c.last_name, COUNT(*) 
FROM customer c
LEFT JOIN cust_order co
ON c.customer_id = co.customer_id
GROUP BY c.customer_id
ORDER BY COUNT(DISTINCT( co.order_id)) DESC LIMIT 1;

""" , con = conn) 
g

   customer_id first_name  last_name  COUNT(*)
0          764   Giuditta  Giorgetti        20

In [12]:
# 5. What shipping method is most preferred, and what percentage of total

h = pd.read_sql_query("""

SELECT sm.method_name, COUNT(*),COUNT(*) * 100.0 / SUM(COUNT(*)) OVER() AS 'Percent of total'
FROM shipping_method sm
RIGHT JOIN cust_order co
ON sm.method_id = co.shipping_method_id
GROUP BY sm.method_name
ORDER BY COUNT(*) DESC;

""" , con = conn) 
h

     method_name  COUNT(*)  Percent of total
0       Priority      1902          25.19205
1        Express      1891          25.04636
2  International      1880          24.90066
3       Standard      1877          24.86093

In [13]:
# 6. author who published the most books:

i = pd.read_sql_query("""

SELECT a.author_id, a.author_name, COUNT(DISTINCT(b.book_id)) AS 'Books Published'
FROM author a
INNER JOIN book_author ba
ON a.author_id = ba.author_id
INNER JOIN book b
ON ba.book_id = b.book_id 
GROUP BY a.author_id
ORDER BY COUNT(DISTINCT(b.book_id)) DESC
LIMIT 1;

""" , con = conn) 
i

   author_id   author_name  Books Published
0       8222  Stephen King               70

In [14]:
# 7. best-selling author

j = pd.read_sql_query("""

SELECT a.author_id, a.author_name, COUNT(ol.order_id) AS Num_Sold 
FROM author a
INNER JOIN book_author ba
ON a.author_id = ba.author_id
INNER JOIN book b
ON ba.book_id= b.book_id
INNER JOIN order_line ol
ON b.book_id = ol.book_id
GROUP BY a.author_id
ORDER BY COUNT(ol.order_id) DESC 
LIMIT 1;

""" , con = conn) 
j

   author_id   author_name  Num_Sold
0       8222  Stephen King        97

In [15]:
# 8. best-selling book
# books sold total

k = pd.read_sql_query("""

SELECT COUNT(book_id)
FROM order_line;

""" , con = conn) 
k

   COUNT(book_id)
0           15400

In [16]:
# DISTINCT books sold in total

l = pd.read_sql_query("""

SELECT COUNT(DISTINCT(book_id))
FROM order_line;

""" , con = conn) 
l

   COUNT(DISTINCT(book_id))
0                      8311

In [17]:
# best-selling book

m = pd.read_sql_query("""

SELECT b.book_id, b.title, COUNT(*)
FROM book b
RIGHT JOIN order_line ol
ON b.book_id = ol.book_id
GROUP BY b.book_id
ORDER BY COUNT(*) DESC
LIMIT 10;

""" , con = conn) 
m

   book_id                                              title  COUNT(*)
0     7513                         Secret Identity (Lost  #2)         8
1     1013                Justine (The Alexandria Quartet #1)         8
2     3917                                  Idoru (Bridge #2)         7
3      773                                          Grizzwold         7
4     7451  The Mammoth Book of New Jules Verne Adventures...         7
5     1354                            How Green Was My Valley         6
6     2473                  Rose in Bloom (Eight Cousins  #2)         6
7     2386       Shadow & Claw (The Book of the New Sun #1-2)         6
8      965                                      Under the Net         6
9     2810                                    The Fourth Hand         6

In [18]:
# 9. Which book makes the most profit: 

n = pd.read_sql_query("""

SELECT ol.book_id, b.title, a.author_name, SUM(ol.price) 
FROM order_line ol
LEFT JOIN book b
ON ol.book_id = b.book_id
LEFT JOIN book_author ba
ON b.book_id = ba.author_id
LEFT JOIN author a
ON ba.author_id = a.author_id
GROUP BY ol.book_id 
ORDER BY SUM(ol.price) DESC 
LIMIT 1;

""" , con = conn) 
n

,book_id,title,author_name,SUM(ol.price)
0,5995,Frogs/Assemblywomen/Wealth (Loeb Classical Lib...,Mercedes Lackey,1559.18

In [19]:
# 10. The top five books with the most language versions 

o = pd.read_sql_query("""

SELECT b.title, b.book_id, bl.language_name, COUNT(*) 
FROM book b
LEFT JOIN book_language bl
ON b.language_id = bl.language_id
GROUP BY b.book_id
ORDER BY COUNT(DISTINCT(bl.language_name)) DESC 
LIMIT 5;

""" , con = conn) 
o

,title,book_id,language_name,COUNT(*)
0,The World's First Love: Mary Mother of God,1,United States English,1
1,The Illuminati,2,English,1
2,The Servant Leader,3,English,1
3,What Life Was Like in the Jewel in the Crown: ...,4,English,1
4,Cliffs Notes on Aristophanes' Lysistrata The ...,5,English,1

In [20]:
# 11. Books in different languages rank

p = pd.read_sql_query("""

SELECT bl.language_id, bl.language_name, COUNT(*), COUNT(*) * 100.0 / SUM(COUNT(*)) OVER() AS 'Percent of total'
FROM book_language bl
RIGHT JOIN book b
ON bl.language_id = b.language_id
GROUP BY b.language_id
ORDER BY COUNT(*) DESC;

""" , con = conn) 
p

    language_id          language_name  COUNT(*)  Percent of total
0             1                English      8911          80.08448
1             2  United States English      1409          12.66289
2             4                Spanish       218           1.95920
3             5        British English       214           1.92325
4             3                 French       144           1.29415
5            10                 German        99           0.88973
6            11               Japanese        46           0.41341
7             6     Multiple Languages        19           0.17076
8            14                Chinese        14           0.12582
9             7                  Greek        11           0.09886
10           16             Portuguese        10           0.08987
11            9       Canadian English         7           0.06291
12           18                Italian         5           0.04494
13            8         Middle English         3           0.02696
14           15                  Latin         3           0.02696
15           19                Russian         2           0.01797
16           23                Swedish         2           0.01797
17           12                 Arabic         1           0.00899
18           13                  Dutch         1           0.00899
19           17                Serbian         1           0.00899
20           20              Malaysian         1           0.00899
21           21               Galician         1           0.00899
22           22                  Welsh         1           0.00899
23           24              Norwegian         1           0.00899
24           25                Turkish         1           0.00899
25           26                 Gaelic         1           0.00899
26           27                  Aleut         1           0.00899

In [21]:
# 12. Which customer brings in the most profit?

q = pd.read_sql_query("""

SELECT c.customer_id, c.first_name, c.last_name, SUM(ol.price) AS Spent 
FROM customer c
INNER JOIN cust_order co
ON c.customer_id = co.customer_id
INNEr JOIN order_line ol
ON co.order_id = ol.order_id 
GROUP BY c.customer_id
ORDER BY Spent DESC
LIMIT 5;

""" , con = conn) 
q

   customer_id first_name last_name   Spent
0          559    Cthrine    Spence  405.99
1         1549       Leda    Futter  405.58
2         1503      Arlen      Plum  383.25
3         1117     Nettie  Halladey  375.91
4         1497  Friedrich   Fallows  365.01

In [22]:
# 13. The top five cities have the most orders placed by customers. 

r = pd.read_sql_query("""

SELECT ad.city, ctr.country_name, COUNT(*), COUNT(*) * 100.0 / SUM(COUNT(*)) OVER() AS 'Percent of total'
FROM address ad
INNER JOIN customer_address ca
ON ad.address_id = ca.address_id
INNER JOIN cust_order co
ON ca.customer_id = co.customer_id
INNER JOIN order_line ol
ON co.order_id = ol.order_id
INNER JOIN country ctr
ON ad.country_id = ctr.country_id
GROUP BY ad.city, ctr.country_name
ORDER BY COUNT(*) DESC 
LIMIT 5;

""" , con = conn) 
r

          city  country_name  COUNT(*)  Percent of total
0    Creighton  South Africa       156           0.49047
1         Klau     Indonesia       155           0.48733
2       Xinhua         China       155           0.48733
3    Barbacena        Brazil       152           0.47790
4  Gościeradów        Poland       149           0.46847

## Adding External Data Sources

In [56]:
popdata = pd.read_csv('API_SP.POP.TOTL_DS2_en_csv_v2_4770387_2.csv')
incomedata = pd.read_csv('Metadata_Country_API_SP.POP.TOTL_DS2_en_csv_v2_4770387_2.csv')

In [34]:
print(popdata.shape)
print(popdata.columns)
popdata

(265, 4)
Index(['countrycode', 'countryname', 'population2020', 'population2021'], dtype='object')

    countrycode                  countryname  population2020  population2021
0           ABW                        Aruba          106585          106537
1           AFE  Africa Eastern and Southern       685112705       702976832
2           AFG                  Afghanistan        38972230        40099462
3           AFW   Africa Western and Central       466189102       478185907
4           AGO                       Angola        33428486        34503774
..          ...                          ...             ...             ...
260         XKX                       Kosovo         1790133         1786038
261         YEM                  Yemen, Rep.        32284046        32981641
262         ZAF                 South Africa        58801927        59392255
263         ZMB                       Zambia        18927715        19473125
264         ZWE                     Zimbabwe        15669666        15993524

[265 rows x 4 columns]

In [28]:
r = pd.read_sql_query("""
drop table population;
""" , con = conn) 

## May output error table does not exist, this is just helpful for restart.

TypeError: 'NoneType' object is not iterable

In [29]:
r = pd.read_sql_query("""
create TABLE population (
	countrycode varchar(5),
	countryname varchar(100),
	population2020 bigint,
	population2021 bigint
	)
""" , con = conn) 

## Will always output error TypeError: 'NoneType' object is not iterable -- you can ignore

TypeError: 'NoneType' object is not iterable

In [30]:
cursor = conn.cursor()
for i,row in popdata.iterrows():
            sql = "INSERT INTO population VALUES (%s,%s,%s,%s)"
            cursor.execute(sql, tuple(row))
            conn.commit()

In [31]:
pd.read_sql_query("""
select * from population
""" , con = conn)

    countrycode                  countryname  population2020  population2021
0           ABW                        Aruba          106585          106537
1           AFE  Africa Eastern and Southern       685112705       702976832
2           AFG                  Afghanistan        38972230        40099462
3           AFW   Africa Western and Central       466189102       478185907
4           AGO                       Angola        33428486        34503774
..          ...                          ...             ...             ...
260         XKX                       Kosovo         1790133         1786038
261         YEM                  Yemen, Rep.        32284046        32981641
262         ZAF                 South Africa        58801927        59392255
263         ZMB                       Zambia        18927715        19473125
264         ZWE                     Zimbabwe        15669666        15993524

[265 rows x 4 columns]

In [57]:
print(incomedata.shape)
print(incomedata.columns)
incomedata

(265, 4)
Index(['countrycode', 'region', 'incomegroup', 'countryname'], dtype='object')

,countrycode,region,incomegroup,countryname
0,ABW,Latin America & Caribbean,High income,Aruba
1,AFE,NaN,NaN,Africa Eastern and Southern
2,AFG,South Asia,Low income,Afghanistan
3,AFW,NaN,NaN,Africa Western and Central
4,AGO,Sub-Saharan Africa,Lower middle income,Angola
...,...,...,...,...
260,XKX,Europe & Central Asia,Upper middle income,Kosovo
261,YEM,Middle East & North Africa,Low income,"Yemen, Rep."
262,ZAF,Sub-Saharan Africa,Upper middle income,South Africa
263,ZMB,Sub-Saharan Africa,Low income,Zambia
264,ZWE,Sub-Saharan Africa,Lower middle income,Zimbabwe

In [58]:
incomedata = incomedata.dropna()

In [59]:
r = pd.read_sql_query("""
drop table income;
""" , con = conn) 

## May output error table does not exist, this is just helpful for restart.

TypeError: 'NoneType' object is not iterable

In [60]:
r = pd.read_sql_query("""
create TABLE income (
	countrycode varchar(5),
	region varchar(255),
	incomegroup varchar(255),
	countryname varchar(100)
)
""" , con = conn) 

## Will always output error TypeError: 'NoneType' object is not iterable -- you can ignore

TypeError: 'NoneType' object is not iterable

In [61]:
cursor = conn.cursor()
for i,row in incomedata.iterrows():
            sql = "INSERT INTO income VALUES (%s,%s,%s,%s)"
            cursor.execute(sql, tuple(row))
            conn.commit()

In [62]:
pd.read_sql_query("""
select * from income
""" , con = conn)

    countrycode                      region          incomegroup   countryname
0           ABW   Latin America & Caribbean          High income         Aruba
1           AFG                  South Asia           Low income   Afghanistan
2           AGO          Sub-Saharan Africa  Lower middle income        Angola
3           ALB       Europe & Central Asia  Upper middle income       Albania
4           AND       Europe & Central Asia          High income       Andorra
..          ...                         ...                  ...           ...
211         XKX       Europe & Central Asia  Upper middle income        Kosovo
212         YEM  Middle East & North Africa           Low income   Yemen, Rep.
213         ZAF          Sub-Saharan Africa  Upper middle income  South Africa
214         ZMB          Sub-Saharan Africa           Low income        Zambia
215         ZWE          Sub-Saharan Africa  Lower middle income      Zimbabwe

[216 rows x 4 columns]

In [66]:
pd.read_sql_query("""
select * from country
""" , con = conn)

     country_id          country_name
0             1           Afghanistan
1             2  Netherlands Antilles
2             3               Albania
3             4               Algeria
4             5               Andorra
..          ...                   ...
227         228            Yugoslavia
228         229                Zambia
229         230              Zimbabwe
230         231             Singapore
231         232      French Polynesia

[232 rows x 2 columns]

In [64]:
pd.read_sql_query("""
select * from country c
join income i on i.countryname = c.country_name
""" , con = conn)

## There are only matches on 175 rows

,country_id,country_name,countrycode,region,incomegroup,countryname
0,1,Afghanistan,AFG,South Asia,Low income,Afghanistan
1,3,Albania,ALB,Europe & Central Asia,Upper middle income,Albania
2,4,Algeria,DZA,Middle East & North Africa,Lower middle income,Algeria
3,5,Andorra,AND,Europe & Central Asia,High income,Andorra
4,6,Angola,AGO,Sub-Saharan Africa,Lower middle income,Angola
...,...,...,...,...,...,...
170,221,Vietnam,VNM,East Asia & Pacific,Lower middle income,Vietnam
171,229,Zambia,ZMB,Sub-Saharan Africa,Low income,Zambia
172,230,Zimbabwe,ZWE,Sub-Saharan Africa,Lower middle income,Zimbabwe
173,231,Singapore,SGP,East Asia & Pacific,High income,Singapore
174,232,French Polynesia,PYF,East Asia & Pacific,High income,French Polynesia

In [65]:
pd.read_sql_query("""
select * from country c
join population p on p.countryname = c.country_name
""" , con = conn)

## There are only matches on 175 rows

,country_id,country_name,countrycode,countryname,population2020,population2021
0,11,Aruba,ABW,Aruba,106585,106537
1,1,Afghanistan,AFG,Afghanistan,38972230,40099462
2,6,Angola,AGO,Angola,33428486,34503774
3,3,Albania,ALB,Albania,2837849,2811666
4,5,Andorra,AND,Andorra,77700,79034
...,...,...,...,...,...,...
170,175,Samoa,WSM,Samoa,214929,218764
171,111,Kosovo,XKX,Kosovo,1790133,1786038
172,171,South Africa,ZAF,South Africa,58801927,59392255
173,229,Zambia,ZMB,Zambia,18927715,19473125
174,230,Zimbabwe,ZWE,Zimbabwe,15669666,15993524